# **Czyszczenie danych i analiza eksploracyjna. Warsztaty**
Piotr Bobeł ISI 1

Ze względu na to że projekt jest tworzony w środowisku R, Google Colab nie umożliwia podpięcia dysku Google do projektu. Konieczne jest wrzucenie pliku TitanicMess.tsv do zakładki z plikami.

![image.png]()

# 1. Czyszczenie danych
Celem zadania jest oczyszczenie zbioru danych TitanicMess.tsv dostarczonego do zadania.

# 1.1 Analiza wizualna zbioru i import danych
Zadanie rozpocznie się od importu danych z pliku tsv. Następnie przy wykorzystaniu funkcji head i tail wyświetlone zostanie pierwsze i ostatnie 15 rekordów. Wyświetlone rekordy pozwolą na wstępną analizę danych znajdujących się w zbiorze.

In [ ]:
library(tidyverse)

Warning message in system("timedatectl", intern = TRUE):
“running command 'timedatectl' had status 1”
── Attaching packages ─────────────────────────────────────── tidyverse 1.3.1 ──

✔ ggplot2 3.3.5     ✔ dplyr   1.0.7
✔ tibble  3.1.6     ✔ stringr 1.4.0
✔ readr   2.1.1     ✔ forcats 0.5.1
✔ purrr   0.3.4

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [ ]:
titanic <- read.csv("TitanicMess.tsv", header=T, sep='\t', dec=',', na.strings="")

In [ ]:
head(titanic,n = 15)
tail(titanic,n = 15)

   PassengerId Survived Pclass
1   1          0        3
2   2          1        1
3   3          1        3
4   4          1        1
5   5          0        3
6   6          0        3
7   7          0        1
8   8          0        3
9   9          1        3
10 10          1        2
11 11          1        3
12 12          1        1
13 13          0        3
14 11          1        3
15 15          0        3
   Name                                                Sex    Age SibSp Parch
1  Braund, Mr. Owen Harris                             male   22  1     0
2  Cumings, Mrs. John Bradley (Florence Briggs Thayer) female 38  1     0
3  Heikkinen, Miss. Laina                              female 26  0     0
4  Futrelle, Mrs. Jacques Heath (Lily May Peel)        female 35  1     0
5  Allen, Mr. William Henry                            male   35  0     0
6  Moran, Mr. James                                    male   NA  0     0
7  McCarthy, Mr. Timothy J                             male   54  0     0
8  Palsson, Master. Gosta Leonard                      male   2   3     1
9  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)   female 27  0     2
10 Nasser, Mrs. Nicholas (Adele Achem)                 female 14  1     0
11 Sandstrom, Miss. Marguerite Ru&5$$                  female 4   1     1
12 Bonnell, Miss. Elizabeth                            female 58  0     0
13 Saundercock, Mr. William Henry                      male   20  0     0
14 Sandstrom, Miss. Marguerite Ru&5$$                  female 4   1     1
15 Vestrom, Miss. Hulda Amanda Adolfina                female 14  0     0
   Ticket           Fare    Cabin Embarked ship
1  A/5 21171        7,25    NA    S        Titanic
2  PC 17599         71,2833 C85   C        Titanic
3  STON/O2. 3101282 7,925   NA    S        Titanic
4  113803           53,1    C123  S        Titanic
5  373450           8,05    NA    S        Titanic
6  330877           8,4583  NA    Q        Titanic
7  17463            51,8625 E46   S        Titanic
8  349909           21,075  NA    S        Titanic
9  347742           11,1333 NA    S        Titanic
10 237736           30,0708 NA    C        Titanic
11 PP 9549          16,7    G6    S        Titanic
12 113783           26,55   C103  S        Titanic
13 A/5. 2151        8,05    NA    S        Titanic
14 PP 9549          16,7    G6    S        Titanic
15 350406           7,8542  NA    S        Titanic

    PassengerId Survived Pclass Name
878  878        0        3      Petroff, Mr. Nedelio
879  879        0        3      Laleff, Mr. Kristo
880  880        1        1      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
881  881        1        2      Shelley, Mrs. William (Imanita Parrish Hall)
882  882        0        3      Markun, Mr. Johann
883  883        0        3      Dahlberg, Miss. Gerda Ulrika
884  884        0        2      Banfield, Mr. Frederick James
885  885        0        3      Sutehall, Mr. Henry Jr
886  886        0        3      Rice, Mrs. William (Margaret Norton)
887  887        0        2      Montvila, Rev. Juozas
888  888        1        1      Graham, Miss. Margaret Edith
889  889        0        3      Johnston, Miss. Catherine Helen "Carrie"
890  890        1        1      Behr, Mr. Karl Howell
891  891        0        3      Dooley, Mr. Patrick
892 1000        1        1      Mr. Frederick Maxfield Hoyt
    Sex    Age SibSp Parch Ticket           Fare    Cabin Embarked ship
878 male   19  0     0     349212           7,8958  NA    S        Titanic
879 male   NA  0     0     349217           7,8958  NA    S        Titanic
880 female 56  0     1     11767            83,1583 C50   C        Titanic
881 female 25  0     1     230433           26      NA    S        Titanic
882 male   33  0     0     349257           7,8958  NA    S        Titanic
883 female 22  0     0     7552             10,5167 NA    S        Titanic
884 male   28  0     0     C.A./SOTON 34068 10,5    NA    S        Titanic
885 male   25  0     0     SOTON/OQ 392076  7,05    NA    S        Titanic
886 female 39  0     5     382652           29,125  NA    Q        Titanic
887 male   27  0     0     211536           13      NA    S        Titanic
888 female 19  0     0     112053           30      B42   S        Titanic
889 female NA  1     2     W./C. 6607       23,45   NA    S        Titanic
890 male   26  0     0     111369           30      C148  C        Titanic
891 male   32  0     0     370376           7,75    NA    Q        Titanic
892 male   38  1     0     19943            90      C93   S        Titanic

Wykorzystane funkcje dostarczają nam wiele informacji odnośnie zbioru. Widoczne jest że niektóre kolumny są niewłaściwie zaklasyfikowane i brakuje w nich części danych.

# 1.2 Niechciane obserwacje

W zbiorze widoczna jest kolumna ship, określającą statek na którym znajdowali się pasażerowie. Interesują nas tylko osoby znajdujące się na statku Titanic, należy więc sprawdzić czy wszyscy pasażerowie znajdowali się na tym statku. Jeżeli okaże się że wszyscy pasażerowie znajdowali się na jednym statku, kolumnę będzie można usunąć, gdyż nie wpłynie ona na wyniki analizy, ponieważ zawierać będzie tylko jedną wartość. Do sprawdzenia jakie wartości występują w kolumnie wykorzystana zostanie funkcja unique, która zwróci unikalne wartości występujące w kolumnie.

In [ ]:
unique(titanic$ship)

[1] "Titanic"

W kolumnie ship jednyną wartością jest "Titanic" zatem kolumna nie będzie przydatna w analizie i można zostać usunięta. Kolumna zostanie usunięta poprzez wypełnienie kolumny ship wartością NULL.

In [ ]:
titanic$ship <- NULL

Po usunięciu kolumny Ship zbiór danych zostanie sprawdzony, czy wartości w nim się powtarzają. Wykorzystana zostanie do tego kolumna PassengerId wraz z funkcją duplicated. Funkcja ta wyświetli ID pasażerów które powtarzają się w zbiorze danych.

In [ ]:
titanic$PassengerId[duplicated(titanic$PassengerId)]

[1]  11  11 225 225

Znaleziono powtarzające się Id 11 oraz 225. Oznacza to że w zbiorze znajdują się 3 rekordy pasażerów z id 11 i 3 rekordy pasażerów z id 225. Rekordy z powtarzającymi się wartościami zostaną usunięte. Do usunięcia wykorzystana zostanie funkcja distinct, która pozwoli na pominięcie pierwszych przepadków występowania danego ID.

In [ ]:
titanic <- titanic %>% distinct(PassengerId, .keep_all = TRUE)

Kolumna Name określa imię i nazwisko pasażera znajdującego się na statku. Można przyjąć że te informacje nie miały wpływu na szanse na przeżycie katastrofy, kolumna zatem może zostać usunięta.

In [ ]:
titanic$Name <- NULL

# 1.3 Błędy w strukturze
Zbiór zostanie sprawdzony pod względem występowania w nim błędów w strukturze. Będą one dotyczyły występujących literówek lub wartości z poza określonych kluczy wartości. Kolejny raz zostanie wykorzystana funkcja unique. Pozwoli ona na przeanalizowanie czy wartości w kolumach zgadzają się z opisem zbioru.

In [ ]:
unique(titanic$Survived)
unique(titanic$Pclass)
unique(titanic$Sex)
unique(titanic$Embarked)

[1] 0 1

[1] 3 1 2

[1] "male"    "female"  "malef"   "mal"     "fem"     "femmale"

[1] "S"  "C"  "Q"  "So" NA   "Co" "Qe"

Przeszukiwanie wartości unikalnych dostarczyło wiele przydatnych informacji. Wiemy że kolumny Survived i Pclass zawierają wartości zgodne z kluczem. W kolumnach Sex oraz Embarked pojawiły się literówki. Wartości "malef", "mal" zostaną poprawnione na wartość "male" a wartości "fem" oraz "femmale" zostaną poprawione na wartość "female" w kolumnie Sex, ponieważ ich wygląd świadczy na popełnienie błędu przez osobę tworzącą zbiór danych. Literówki są na tyle podobne do ich prawidłowych wartości kluczy, że możliwa jest ich poprawa. W kolumnie Embarked wartości "So", "Co", "Qe" zostaną poprawione odpowiednio na "S", "C", "Q" by były zgodne z kluczem. Podobnie jak w przypadku kolumny Sex, wartości niezgodne z kluczem są na tyle podobne do ich prawidłowych odpowiedników, że jest możliwa ich poprawa. Do poprawy zostanie wykorzystana funkcja replace, która zamieni błędnie wpisany element występujący na przestrzeni całej kolumny, na ten zgodny z kluczem.

In [ ]:
titanic$Sex<-replace(titanic$Sex, titanic$Sex=="malef", "male")
titanic$Sex<-replace(titanic$Sex, titanic$Sex=="mal", "male")
titanic$Sex<-replace(titanic$Sex, titanic$Sex=="fem", "female")
titanic$Sex<-replace(titanic$Sex, titanic$Sex=="femmale", "female")

titanic$Embarked<-replace(titanic$Embarked, titanic$Embarked=="So", "S")
titanic$Embarked<-replace(titanic$Embarked, titanic$Embarked=="Co", "C")
titanic$Embarked<-replace(titanic$Embarked, titanic$Embarked=="Qe", "Q")

Wcześniejsza analiza wskazywała, że niektóre wartości kolumn zostały źle zaklasyfikowane.

In [ ]:
head(titanic,n = 1)

  PassengerId Survived Pclass Sex  Age SibSp Parch Ticket    Fare Cabin
1 1           0        3      male 22  1     0     A/5 21171 7,25 NA
  Embarked
1 S

Kolumny Age oraz Fare zostały zaklasyfikowane jako pola znakowe. Oznacza to że konieczna jest ich konwersja do wartości numerycznych. Do konwersji wykorzystana zostanie funkcja as.numeric. Klasyfikacja do wartości pól znakowych wynika z złego separatora dzisiętnego. Przecinek zostanie zatem zamieniony na kropkę i kolumny będą klasyfikowane jako wartości liczbowe.

In [ ]:
titanic$Age <- as.numeric(sub(",", ".", titanic$Age, fixed = TRUE))
titanic$Fare <- as.numeric(sub(",", ".", titanic$Fare, fixed = TRUE))

Warning message in eval(expr, envir, enclos):
“NAs introduced by coercion”

In [ ]:
summary(titanic$Age)
summary(titanic$Fare)

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.    NA's
 -12.00   20.00   28.00   36.01   38.00 4435.00     173

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.    NA's
-90.000   7.896  14.454  31.997  30.696 512.329       1

Wartości zostały skonwertowane do wartości numerycznych. Konieczne jest natomiast pozbycie się wartości odstających.

# 1.4 Wartości odstające
Poprzednie działania wykazały że dla niektórych rekordów wiek przyjmuje wartość ujemną lub wynosi 4435 lat, oraz koszt niektórych biletów jest ujemny. Konieczne jest usunięcie rekordów zawierających podobne błędy. Wykorzystana zostanie do tego funkcja subset z parametrami, pozwalającymi na zawarcie danych z określonych przedziałów. Dodatkowo wartości z kolumny Fare zostały zaookrąglone do 2 miejsc po przecinku.

In [ ]:
titanic <- subset(titanic, titanic$Age>=0 & titanic$Age<=122 | is.na(titanic$Age))
titanic <- subset(titanic, titanic$Fare>=0 | is.na(titanic$Fare))
titanic$Fare <- round(titanic$Fare, 2)

In [ ]:
summary(titanic$Age)
summary(titanic$Fare)

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.    NA's
   0.42   20.00   28.00   29.63   38.00   80.00     173

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.    NA's
  0.000   7.905  14.450  32.218  30.925 512.330       1

# 1.5 Wartości puste
Ostatnim etapem czyszczenia danych który zostanie wykonany jest analiza wartości pustych.

In [ ]:
sum(is.na(titanic$PassengerId))
sum(is.na(titanic$Survived))
sum(is.na(titanic$Pclass))
sum(is.na(titanic$Sex))
sum(is.na(titanic$Age))
sum(is.na(titanic$SibSp))
sum(is.na(titanic$Parch))
sum(is.na(titanic$Ticket))
sum(is.na(titanic$Fare))
sum(is.na(titanic$Cabin))
sum(is.na(titanic$Embarked))

[1] 0

[1] 0

[1] 0

[1] 0

[1] 173

[1] 0

[1] 0

[1] 0

[1] 1

[1] 681

[1] 2

W kolumnach występuje następująca ilość wartości pustych:
- Age - 173
- Fare - 1
- Cabin - 681
- Embarked - 2

Kolumny Cabin i Embarked pozostaną bez zmian i wartościa NA będą traktowane jako osobna klasa w trakcie analizy.
Dla kolumny fare dla pustej wartości zostanie przyjęta mediana wartości, natomiast dla kolumny age wartości puste zostaną zastąpione wartością -1 która nie występuje w zbiorze, dzięki czemu będzie ona widoczna w trakcie analizy jako osobna klasa.

In [ ]:
titanic$Age<-replace(titanic$Age, is.na(titanic$Age), -1)
titanic$Fare<-replace(titanic$Fare, is.na(titanic$Fare), 14.45)

In [ ]:
summary(titanic$Age)
summary(titanic$Fare)

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  -1.00    6.50   24.00   23.63   35.00   80.00

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
   0.00    7.91   14.45   32.20   30.85  512.33

# 1.6 Eksport pliku
Oczyszczony zbiór danych zostanie wyeksportowany jako TitanicCleaned.tsv. Warunek row.names=FALSE sprawi że do wyeksportowanego pliku nie zostanie dodana kolumna oznaczająca pozycję rekordu w tabeli.

In [ ]:
write.csv(titanic,'TitanicCleaned.tsv',row.names=FALSE)

# **2 Analiza danych**
W tej częsci zostanie przeprowadzona analiza eksploracyjna na przygotowanym wcześniej zbiorze danych. Na początek zostanie sprawdzona ilość osób która przeżyła i nie przeżyła katastrofy. Wykorzystana zostanie do tego funkcja sum, pozwalająca zsumować rekordy z określoną wartością.

In [ ]:
sum(titanic$Survived == '1')
sum(titanic$Survived == '0')

[1] 340

[1] 543

Z dostępnego zbioru danych możemy się dowiedzieć że katastrofę przeżyło 340 osób a zmarło 543 osoby. Istotnym współczynnikiem decydującem na przeżycie może okazać się płeć pasażerów. Sprawdzona zatem zostanie liczba kobiet i mężczyzn która znajdowała się na statku.

In [ ]:
sum(titanic$Sex == 'female')
sum(titanic$Sex == 'male')

[1] 312

[1] 571

Na statku znajdowało się 312 kobiet i 571 mężczyzn. Ponieważ ilość kobiet i mężczyzn jest różna, określona zostanie procentowa ilość mężczyzn i kobiet którzy przeżyli i nie przeżyli katastrofy.

In [ ]:
print ("kobiet przeżyło:")
sum(titanic$Sex == 'female' & titanic$Survived == 1) * 100 / sum(titanic$Sex == 'female')
print ("kobiet nieprzeżyło:")
sum(titanic$Sex == 'female' & titanic$Survived == 0) * 100 / sum(titanic$Sex == 'female')
print ("mężczyzn przeżyło:")
sum(titanic$Sex == 'male' & titanic$Survived == 1) * 100 / sum(titanic$Sex == 'male')
print ("mężczyzn nieprzeżyło:")
sum(titanic$Sex == 'male' & titanic$Survived == 0) * 100 / sum(titanic$Sex == 'male')

[1] "kobiet przeżyło:"

[1] 74.35897

[1] "kobiet nieprzeżyło:"

[1] 25.64103

[1] "mężczyzn przeżyło:"

[1] 18.91419

[1] "mężczyzn nieprzeżyło:"

[1] 81.08581

Uzyskane dane wskazują że kobiety miały dużo większe szanse na przeżycie. Wynika to prawdopodobnie z tego, iż były ewakuwane jako pierwsze. Kolejnym elementem mogącym wpływać na "istotność" pasażerów była klasa w której podróżowali. W zbiorze danych istnieje podział na 3 klasy z czego 1 oznacza najlepszą jakość obsługi i podróżowania a 3 klasa oznacza najgorszą jakość obsługi i podróżowania.

In [ ]:
sum(titanic$Pclass == '1')
sum(titanic$Pclass == '2')
sum(titanic$Pclass == '3')

[1] 213

[1] 183

[1] 487

Dane wskazują że najwięcej osób znajdowało się w klasie 3 natomiast najmniej w klasie 2. Możliwe jest wykonanie podziału by sprawdzić czy któraś klasa miała pierwszeństwo jeżeli chodzi o udzielenie pomocy i ewakuację.

In [ ]:
print ("1 klasa przeżyło:")
sum(titanic$Pclass == 1 & titanic$Survived == 1) * 100 / sum(titanic$Pclass == 1)
print ("2 klasa przeżyło:")
sum(titanic$Pclass == 2 & titanic$Survived == 1) * 100 / sum(titanic$Pclass == 2)
print ("3 klasa przeżyło:")
sum(titanic$Pclass == 3 & titanic$Survived == 1) * 100 / sum(titanic$Pclass == 3)

[1] "1 klasa przeżyło:"

[1] 62.9108

[1] "2 klasa przeżyło:"

[1] 47.54098

[1] "3 klasa przeżyło:"

[1] 24.43532

Dane wskazuję że przydział do klas również miał znaczenie przy określeniu szansy na przeżycie w momencie katastrofy. Możliwe jest połączenie 2 wykonanych wcześniej pomiarów i określenie jak płeć i klasa podróżowania wpływały na szanse na przeżycie.

In [ ]:
print ("1 klasa kobiet przeżyło:")
sum(titanic$Pclass == 1 & titanic$Survived == 1 & titanic$Sex == "female") * 100 / sum(titanic$Pclass == 1 & titanic$Sex == "female")
print ("1 klasa mężczyzn przeżyło:")
sum(titanic$Pclass == 1 & titanic$Survived == 1 & titanic$Sex == "male") * 100 / sum(titanic$Pclass == 1 & titanic$Sex == "male")
print ("2 klasa kobiet przeżyło:")
sum(titanic$Pclass == 2 & titanic$Survived == 1 & titanic$Sex == "female") * 100 / sum(titanic$Pclass == 2 & titanic$Sex == "female")
print ("2 klasa mężczyzn przeżyło:")
sum(titanic$Pclass == 2 & titanic$Survived == 1 & titanic$Sex == "male") * 100 / sum(titanic$Pclass == 2 & titanic$Sex == "male")
print ("3 klasa kobiet przeżyło:")
sum(titanic$Pclass == 3 & titanic$Survived == 1 & titanic$Sex == "female") * 100 / sum(titanic$Pclass == 3 & titanic$Sex == "female")
print ("3 klasa mężczyzn przeżyło:")
sum(titanic$Pclass == 3 & titanic$Survived == 1 & titanic$Sex == "male") * 100 / sum(titanic$Pclass == 3 & titanic$Sex == "male")

[1] "1 klasa kobiet przeżyło:"

[1] 96.77419

[1] "1 klasa mężczyzn przeżyło:"

[1] 36.66667

[1] "2 klasa kobiet przeżyło:"

[1] 92.10526

[1] "2 klasa mężczyzn przeżyło:"

[1] 15.88785

[1] "3 klasa kobiet przeżyło:"

[1] 50.34965

[1] "3 klasa mężczyzn przeżyło:"

[1] 13.66279

Uzyskane wyniki pokazują że kobiety podróżujące pierwszą klasą miały prawie 97% szans na przeżycie, a mężczyźni podróżujący tą samą klasą zaledwie 37%. Zasobność portfela pasażerów miała zatem istotny wpływ na ich szansę na przeżycie. Ostatnim przebadanym aspektem miejącym wpływ na przeżycie będzie wiek pasażerów. Wybrane zostały odpowiednie przedziały wiekowe mogące identyfikować przykładowo dzieci, młodzież oraz ludzi dorosłych.

In [ ]:
print ("Wiek od 0 - 12 przeżyło:")
sum(titanic$Age >= 0 & titanic$Age <= 12 & titanic$Survived == 1) * 100 / sum(titanic$Age >= 0 & titanic$Age <= 12)
print ("Wiek od 13 - 24 przeżyło:")
sum(titanic$Age > 12 & titanic$Age <= 24 & titanic$Survived == 1) * 100 / sum(titanic$Age > 12 & titanic$Age <= 24)
print ("Wiek od 25 - 45 przeżyło:")
sum(titanic$Age > 24 & titanic$Age <= 45 & titanic$Survived == 1) * 100 / sum(titanic$Age > 24 & titanic$Age <= 45)
print ("Wiek od 46 - 100 przeżyło:")
sum(titanic$Age > 45 & titanic$Age <= 100 & titanic$Survived == 1) * 100 / sum(titanic$Age > 45 & titanic$Age <= 100)
print ("Wiek nieznany przeżyło:")
sum(titanic$Age == -1 & titanic$Survived == 1) * 100 / sum(titanic$Age == -1)

[1] "Wiek od 0 - 12 przeżyło:"

[1] 58.57143

[1] "Wiek od 13 - 24 przeżyło:"

[1] 37.5

[1] "Wiek od 25 - 45 przeżyło:"

[1] 40.42553

[1] "Wiek od 46 - 100 przeżyło:"

[1] 36.8932

[1] "Wiek nieznany przeżyło:"

[1] 28.90173

Wiek w przypadku najmłodszych dzieci miał znaczenie w przypadku szansy na ich przeżycie. W pozostałych grupach wiekowaych szansa na przeżycie klasuje się podobnie, zatem możemy stwierdzić iż największy wpływ na szanse na przeżycie katastrofy ma płeć oraz klasa w której podróżowali pasażerowie. Zwiększone szanse na przeżycie miały również najmłodsze dzieci. W najlepszej sytuacji uplasowały się kobiety które podróżowały pierwszą klasą. Aż 97% takich osób przeżyło katastrofę statku Titanic.